#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

data.terraform_remote_state.rds: Reading...
data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.terraform_remote_state.rds: Read complete after 0s
data.aws_vpc.vpc: Read complete after 1s [id=vpc-009b0a699704bf9c5]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-08ebd9fd78c01f015"]: Reading...
data.aws_subnet.subnet["subnet-04620374fe59ef1ac"]: Reading...
data.aws_subnet.subnet["subnet-0d603d8a57ee8998e"]: Reading...
data.aws_subnet.subnet["subnet-01949927b7ff6ef5e"]: Reading...
data.aws_subnet.subnet["subnet-02a250369eb3c2fbf"]: Reading...
data.aws_subnet.subnet["subnet-09e8c3a446ffff4a6"]: Reading...
data.aws_subnet.subnet["subnet-04620374fe59ef1ac"]: Read complete after 0s [id=subnet-04620374fe59ef1ac]
data.aws_subnet.subnet["subnet-0d603d8a57ee8998e"]: Read complete after 0s [id=subnet-0d603d8a57ee8998e]
data.aws_subnet.subnet["subnet-02a250369eb3c2fbf"]: Read complete after 1s [id=subnet-02a250369eb3c2fbf]
data.aws_subnet.subnet["subnet-09e8c3a446ffff4a6"]: Read complete after 1s [id=subnet-09e8c3a446ffff4a6]
data.aws_subnet.subnet["subnet-08ebd9fd78c01f015"]: Read complete after 1s [id=subnet-08ebd9fd78c01f015]
data.aws_subnet.subnet["subnet-01949927b7ff6ef5e"]: Read complete after 1s [id=subnet-01949927b7ff6ef5e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "tech-challenge-lanchonete"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "fiap",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::032071274530:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "tech-challenge-lanchonete"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::032071274530:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "tech-challenge-lanchonete"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::032071274530:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-01949927b7ff6ef5e",
              + "subnet-02a250369eb3c2fbf",
              + "subnet-04620374fe59ef1ac",
              + "subnet-08ebd9fd78c01f015",
              + "subnet-0d603d8a57ee8998e",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech-challenge-lanchonete"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "NG-tech-challenge-lanchonete"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::032071274530:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-01949927b7ff6ef5e",
          + "subnet-02a250369eb3c2fbf",
          + "subnet-04620374fe59ef1ac",
          + "subnet-08ebd9fd78c01f015",
          + "subnet-0d603d8a57ee8998e",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "EKS Cluster Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound traffic to RDS"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "SG-tech-challenge-lanchonete"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-009b0a699704bf9c5"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on k8s-configs.tf line 1, in provider "kubernetes":
   1: provider "kubernetes" {

'config_path' refers to an invalid path: "/home/runner/.kube/config": stat
/home/runner/.kube/config: no such file or directory

```

</details>

*Pushed by: @anadezuo, Action: `pull_request`*